IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM23_CONTROLSS_G0_EPWM23.xml
	<register id="CONTROLSS_G0_EPWM23_XCMP2_SHDW1" acronym="CONTROLSS_G0_EPWM23_XCMP2_SHDW1" offset="0x684" width="32" description="Additional Compare 2 Shadow 1 Register">
		<bitfield id="XCMP2_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP2_SHDW1 Register The value in the XCMP2_SHDW1 register is loaded into XCMP2_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP2HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP2HR_SHDW1 Register  The value in the XCMP2HR_SHDW1 register is loaded into XCMP2HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM23_XCMP3_SHDW1" acronym="CONTROLSS_G0_EPWM23_XCMP3_SHDW1" offset="0x688" width="32" description="Additional Compare 3 Shadow 1 Register">
		<bitfield id="XCMP3_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP3_SHDW1 Register The value in the XCMP3_SHDW1 register is loaded into XCMP3_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP3HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP3HR_SHDW1 Register  The value in the XCMP3HR_SHDW1 register is loaded into XCMP3HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM23_XCMP4_SHDW1" acronym="CONTROLSS_G0_EPWM23_XCMP4_SHDW1" offset="0x68C" width="32" description="Additional Compare 4 Shadow 1 Register">
		<bitfield id="XCMP4_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP4_SHDW1 Register The value in the XCMP4_SHDW1 register is loaded into XCMP4_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP4HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP4HR_SHDW1 Register  The value in the XCMP4HR_SHDW1 register is loaded into XCMP4HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM23_XCMP5_SHDW1" acronym="CONTROLSS_G0_EPWM23_XCMP5_SHDW1" offset="0x690" width="32" description="Additional Compare 5 Shadow 1 Register">
		<bitfield id="XCMP5_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP5_SHDW1 Register The value in the XCMP5_SHDW1 register is loaded into XCMP5_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP5HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP5HR_SHDW1 Register  The value in the XCMP5HR_SHDW1 register is loaded into XCMP5HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM23_XCMP6_SHDW1" acronym="CONTROLSS_G0_EPWM23_XCMP6_SHDW1" offset="0x694" width="32" description="Additional Compare 6 Shadow 1 Register">
		<bitfield id="XCMP6_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP6_SHDW1 Register The value in the XCMP6_SHDW1 register is loaded into XCMP6_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP6HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP6HR_SHDW1 Register  The value in the XCMP6HR_SHDW1 register is loaded into XCMP6HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM23_XCMP7_SHDW1" acronym="CONTROLSS_G0_EPWM23_XCMP7_SHDW1" offset="0x698" width="32" description="Additional Compare 7 Shadow 1 Register">
		<bitfield id="XCMP7_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP7_SHDW1 Register The value in the XCMP7_SHDW1 register is loaded into XCMP7_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP7HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP7HR_SHDW1 Register  The value in the XCMP7HR_SHDW1 register is loaded into XCMP7HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM23_XCMP8_SHDW1" acronym="CONTROLSS_G0_EPWM23_XCMP8_SHDW1" offset="0x69C" width="32" description="Additional Compare 8 Shadow 1 Register">
		<bitfield id="XCMP8_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="XCMP8_SHDW1 Register The value in the XCMP8_SHDW1 register is loaded into XCMP8_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP8HR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="XCMP8HR_SHDW1 Register  The value in the XCMP8HR_SHDW1 register is loaded into XCMP8HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM23_XTBPRD_SHDW1" acronym="CONTROLSS_G0_EPWM23_XTBPRD_SHDW1" offset="0x6A0" width="32" description="Additional Time Base Period Shadow 1 Register">
		<bitfield id="XTBPRD_SHDW1" width="16" begin="31" end="16" resetval="0x0" description="The value in the XTBPRD_SHDW1 register is loaded into XTBPRD_ ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XTBPRDHR_SHDW1" width="16" begin="15" end="0" resetval="0x0" description="The value in the XTBPRDHR_SHDW1 register is loaded into XTBPRDHR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM23_XAQCTLA_SHDW1" acronym="CONTROLSS_G0_EPWM23_XAQCTLA_SHDW1" offset="0x6B0" width="16" description="XAQCTLA Shadow 1 Register">
		<bitfield id="XCMP8" width="2" begin="15" end="14" resetval="0x0" description="Action when Counter = CMP8 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="XCMP7" width="2" begin="13" end="12" resetval="0x0" description="Action when Counter = CMP7 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="XCMP6" width="2" begin="11" end="10" resetval="0x0" description="Action when Counter = CMP6 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="XCMP5" width="2" begin="9" end="8" resetval="0x0" description="Action when Counter = CMP5 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="XCMP4" width="2" begin="7" end="6" resetval="0x0" description="Action when Counter = CMP4 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="XCMP3" width="2" begin="5" end="4" resetval="0x0" description="Action when Counter = CMP3 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="XCMP2" width="2" begin="3" end="2" resetval="0x0" description="Action when Counter = CMP2 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="XCMP1" width="2" begin="1" end="0" resetval="0x0" description="Action when Counter = CMP1 0,0 Do nothing [action disabled] 0,1 Clear [low] 1,0 Set [high] 1,1 Toggle [Low -> High, High -> Low]" range="1 - 0" rwaccess="R/W"/>
	</register>
